var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "张士桦",
    sex: "女",
    age: "23",
    phone: "17837170284",
    email: "zzuzhangshihua@163.com",
    address: "现居河南省开封市",
    qq: "2783037227",
    log: "Luckimaru",
    excpect_work: "新媒体运营",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好！我叫张士桦，郑州大学新闻与传播学院研二在读<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫张士桦，性别女，郑州大学新闻与传播学院研二在读。我期望的工作岗位新媒体运营。</p>" +
        "<p>我有着较多的新媒体工作经验，广告营销知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受加班或出差等安排。</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["摄影", 85, "red"],
        ["PS", 85, "blue"],
        ["PR", 80, "#1abc9c"],
        ["剪映", 90, "rgba(0,0,0)"],
        ["AE", 70, "yellow"],
        ["Office", 85, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>熟练使用Office办公软件</li><br>" +
        "     <li>熟练使用PS、AI等设计软件</li><br>" +
        "     <li>熟练使用PR、AE等视频剪辑软件</li><br>" +
        "     <li>掌握Spss数据处理软件</li><br>" +
        "     <li>熟练使用专业相机摄影及后期</li><br>" +
        "     <li>拥有视频采访和剪辑工作经验</li><br>" +
        "     <li>拥有新闻摄影以及广告艺术摄影经验</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "http://1.15.234.109:8000/", "个人博客", "这里记录了我的Java后端学习笔记<br>持续更新"],
        ["./images/pro-2.png", "https://github.com/happysnaker/Gobang", "智能人机对战五子棋", "采用C++编写的智能五子棋人机对战<br>2021/7/23"],
        ["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"],
["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"],
["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2022/10 — 2023/01", "<br>新媒体运营实习生",
            "<p><strong>星空财富公司新媒体运营部</strong></p>" +
            "<p>工作描述：日常负责财经媒体的社群运营和新媒体运营，持续提升社交媒体的知名度、粉丝量及影响力；设计图片，制作短视频，通过有吸引力的图文内容吸引用户，实现转化；在百家号、新浪微博、今日头条、知乎等社交媒体进行内容创作及分发；分析运营数据并反馈现状及问题。</p>"
        ],

        ["2022/07 — 2022/09", "<br>实习记者",
            "<p><strong>凤凰网</strong></p>" +
            "<p>工作描述：配合部门老师，负责相关稿件的采访和撰写，在两个月内产出20+篇新闻稿件。</p>" 
        ],

        ["2021/09 — 2022/12", "<br>研究生助管",
            "<p><strong>郑州大学党委宣传部</strong></p>" +
            "<p>工作描述：配合部门老师，负责学校内宣和外宣、精神文明建设、党史学习教育宣传、各种活动的采访与撰稿等工作。</p>" 
        ],

        ["2020/09 — 2023/01", "<br>独立摄影师+自媒体运营",
            "<p><strong>摄影工作室</strong></p>" +
            "<p>工作描述：成立摄影工作室，承接各种风格的人像摄影，累计作品几十幅。同时运营社交媒体，发布摄影作品，单篇阅读量近8万。</p>" 
        ],
		
		["2019/07 — 2019/09", "<br>新媒体运营",
		    "<p><strong>欧莱雅义卖项目运营部</strong></p>" +
		    "<p>工作描述：设计宣传方案并主导实施，搭建对应的名人资源实现引流，活动开始48个小时内下单件数共计3312件，共计达成215439.45元销售额。</p>" 
		],
		
		["2018/04 — 2020/05", "<br>公众号运营",
		    "<p><strong>郑州大学校园微信公众号</strong></p>" +
		    "<p>工作描述：负责郑大勤工助学校园微信公众号运营，在一年内策划5期活动，推送90+篇文章，实现粉丝数量增长200％，文章阅读总量30万人次。</p>" 
		]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2017-09", "郑州大学本科阶段开启","广告学专业本科"],
		["2018-03", "2018寒假实践活动全媒体类作品二等奖", "大二下学期初参与寒假实践活动获奖"],
        ["2018-05", "获得优秀团干、优秀青年志愿者等荣誉称号", "大一下学期，我通过面向全年级的选拔，获得此荣誉称号。"],
        ["2019-09", "暑期实践活动调研类作品一等奖","2019年暑期与同学组队参与暑期实践获奖"],
		["2019-11", "第五届中国“互联网+”大学生创新创业大赛二等奖和优秀奖","大三上学期，与校内各个学院优秀小伙伴组团参加该比赛获奖"],
        ["2020-03", "春季大学生广告节营销策划类优秀奖", "大三下学期参与“大学生广告艺术节学院奖”比赛获奖"],
		["2021-06", "郑州大学本科生涯结束","GPA年级前20%"],
		["2021-09", "郑州大学研究生阶段开启", "就读新闻与传播专业，研究方向为区块链对传媒产业的变革"],
		["2022-03", "2022年春季大学生广告节视频类优秀奖", "研一下学期参与“大学生广告艺术节学院奖”比赛获奖"],
		["2022-10", "郑州大学先进宣传个人", "在研一学年的工作中被评为郑州大学先进宣传个人"]
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
/*
    icon: [
        ["./svg/LeetCode.svg", "https://leetcode-cn.com/u/happysnaker/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/happysnaker", "我的GitHub主页"],
        ["./svg/博客.svg", "http://1.15.234.109:8000", "我的个人博客"],
        ["./svg/掘金.svg", "https://juejin.cn/user/3853167638625000", "我的掘金主页"],
        ["./svg/知乎.svg", "https://www.zhihu.com/people/tian-xia-you-dao-81", "我的知乎主页"]
    ],
*/


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}