var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "边凯泉",
    sex: "男",
    age: "24",
    phone: "18837557073",
    email: "2590856377@qq.com",
    address: "现居河南省开封市",
    qq: "2590856377",
    log: "Damahou",
    excpect_work: "后端开发实习生",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好！我叫边凯泉，暨南大学信息科学与技术学院研二在读<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫边凯泉，性别男，暨南大学信息科学与技术学院研二在读。我期望的工作岗位是后端开发岗位。</p>" +
        "<p>我有着较强的coding能力，计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受加班或出差等安排。</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Java", 85, "red"],
        ["MySQL", 85, "blue"],
        ["Linux", 80, "#1abc9c"],
        ["Network", 80, "rgba(0,0,0)"],
        ["Redis", 75, "yellow"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>基础知识：对MySQL及其底层原理、计算机网络常见协议原理、操作系统相关原理与Redis底层原理有一定了解</li><br>" +
        "     <li>开发框架：了解Spring框架、MyBatis框架，有第三方中间件技术融合经验，对前端框架Vue有一定了解。</li><br>" +
        "     <li>语言基础：对Java语言的使用有一定的熟练度，对JVM、JUC 多线程开发、JavaNIO及网络编程等有一定了解</li><br>" +
        "     <li>工具掌握：对docker容器技术、开发流程版本控制与Kubernetes容器编排技术有一定了解。</li><br>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/pro-1.png", "http://1.15.234.109:8000/", "个人博客", "这里记录了我的Java后端学习笔记<br>持续更新"],
        ["./images/pro-2.png", "https://github.com/happysnaker/Gobang", "智能人机对战五子棋", "采用C++编写的智能五子棋人机对战<br>2021/7/23"],
        ["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"],
["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"],
["https://pic3.zhimg.com/80/v2-d9766956d5c85c2780e4c5008fd946ca_1440w.jpg", "https://github.com/happysnaker/StudentsManageSystem", "学生管理系统", "C语言+AVL树+多重双向表实现"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2021/06 — 2021/09", "<br>java后端开发/运维工程师",
            "<p><strong>河南信大网域有限公司</strong></p>" +
            "<p>工作描述：负责一项Spring boot项目的二次开发，添加过滤器完善用户登录逻辑，负责该项目在K8S集群环境部署与维护 </p>"
        ],

        ["2022/02 — 2022/03", "<br>软件研发实习岗位",
            "<p><strong>广州华微明天软件技术有限公司</strong></p>" +
            "<p>工作描述：参与公司的Web Gis开发工作，研究Cesium开源库并替代百度地图API完成公司旧产品的技术迁移工作。</p>" 
        ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2017-09", "郑州大学本科阶段开启","信息管理与信息系统本科"],
        ["2018-05", "第三届全国SAP模拟经营大赛全国第8名", ""],
		["2018-10", "国家励志奖学金（10%）", ""],
        ["2019-04", "获得计算机三级网络技术证书，四级网络工程师证书", ""],
        ["2019-10，2020-10", "连续两年郑州大学一等奖学金（5%）",""],
		["2021-06", "郑州大学本科生涯结束","GPA:  3.66/4.00"],
		["2021-09", "暨南大学研究生阶段开启", "就读电子信息(计算机技术)专业，研究方向为智慧教育-知识追踪方向"],
		["2022-04", "软考中级软件设计师证书", ""],
		["2022-10", " 暨南大学研究生阶段课程成绩总排名第一名", ""]
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
/*
    icon: [
        ["./svg/LeetCode.svg", "https://leetcode-cn.com/u/happysnaker/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/happysnaker", "我的GitHub主页"],
        ["./svg/博客.svg", "http://1.15.234.109:8000", "我的个人博客"],
        ["./svg/掘金.svg", "https://juejin.cn/user/3853167638625000", "我的掘金主页"],
        ["./svg/知乎.svg", "https://www.zhihu.com/people/tian-xia-you-dao-81", "我的知乎主页"]
    ],
*/


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}